exercises/Exercise10/exercise10.tex
% Created 2016-04-28 to. 11:20
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Sindre Hansen}
\date{\today}
\title{Exercise 10}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Safety/Deadlock Assigment}
\label{sec-1}
\subsection{LTSA detection}
\label{sec-1-1}
The built-in safety criterion works as expected, and LTSA detects the deadlock.
\subsection{Detecting deadlock in the FSP model}
\label{sec-1-2}
\uline{blank}

\section{Dining philosophers}
\label{sec-2}
\subsection{Transition diagram for two philosophers}
\label{sec-2-1}

\subsection{FSP model of 3 philosophers and 3 forks}
\label{sec-2-2}
The following code snippet shows a system with 3 philosophers and 3 forks.

\begin{verbatim}
PHIL = (sitdown->right.get->left.get
          ->eat->left.put->right.put
          ->arise->PHIL).

FORK = (get -> put -> FORK).

||DINERS(N=3)=
   forall [i:0..N-1]
   (phil[i]:PHIL
   ||{phil[i].left,phil[((i-1)+N)%N].right}::FORK).

menu RUN = {phil[0..2].{sitdown,eat}}
\end{verbatim}
This is the output when checking the system. It clearly ends in a deadlock.

\begin{verbatim}
Composition:
DINERS = phil.0:PHIL || {phil.0.left,phil.2.right}::FORK ||
         phil.1:PHIL || {phil.1.left,phil.0.right}::FORK ||
         phil.2:PHIL || {phil.2.left,phil.1.right}::FORK
State Space:
 7 * 2 * 7 * 2 * 7 * 2 = 2 ** 12
Analysing...
Depth 7 -- States: 60 Transitions: 155 Memory used: 3361K
Trace to DEADLOCK:
phil.0.sitdown
phil.0.right.get
phil.1.sitdown
phil.1.right.get
phil.2.sitdown
phil.2.right.get
\end{verbatim}

\section{Communication}
\label{sec-3}
\subsection{Synchronous communication}
\label{sec-3-1}
\begin{verbatim}
range X = 0..2
CHAN = (trans[x:X]->CHAN).
PROD = (c.send[0]->c.send[1]->c.send[2]->PROD)/{c.trans/c.send}.
CONS = (c.receive [v:X]->CONS){c.trans/c.send}.
\end{verbatim}

\subsection{Asynchronous communication}
\label{sec-3-2}
The following snippet models a five slot buffered channel.
\begin{verbatim}
const N = 5
BUFFER = COUNT[0],c
COUNT[i:0..N] = (when (i<N) put -> COUNT[i+1] |
                 when (i>0) get -> COUNT[i-1]
                )/{send/put, receive/get}.
PRODUCER = (c.send -> PRODUCER).
CONSUMER = (c.receive -> CONSUMER).

|| BOUNDEDCHAN = (PRODUCER || CONSUMER || c::BUFFER).
\end{verbatim}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
